atsamd-rs/atsamd/svd/ATSAMD11C14A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>EIC</name>
         <version>U22171.0.1</version>
         <description>External Interrupt Controller</description>
         <baseAddress>0x40001800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EIC</name>
            <description>External Interrupt Controller</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SYNCBUSY</name>
                     <description>Synchronization Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICTRL</name>
               <description>Non-Maskable Interrupt Control</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>NMISENSE</name>
                     <description>Non-Maskable Interrupt Sense</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NMISENSESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising-edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling-edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both-edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High-level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low-level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMIFILTEN</name>
                     <description>Non-Maskable Interrupt Filter Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIFLAG</name>
               <description>Non-Maskable Interrupt Flag Status and Clear</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>NMI</name>
                     <description>Non-Maskable Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>EXTINTEO0</name>
                     <description>External Interrupt 0 Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO1</name>
                     <description>External Interrupt 1 Event Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO2</name>
                     <description>External Interrupt 2 Event Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO3</name>
                     <description>External Interrupt 3 Event Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO4</name>
                     <description>External Interrupt 4 Event Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO5</name>
                     <description>External Interrupt 5 Event Output Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO6</name>
                     <description>External Interrupt 6 Event Output Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINTEO7</name>
                     <description>External Interrupt 7 Event Output Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x8</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>External Interrupt 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT1</name>
                     <description>External Interrupt 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT2</name>
                     <description>External Interrupt 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT3</name>
                     <description>External Interrupt 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT4</name>
                     <description>External Interrupt 4 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT5</name>
                     <description>External Interrupt 5 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT6</name>
                     <description>External Interrupt 6 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT7</name>
                     <description>External Interrupt 7 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0xC</addressOffset>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>External Interrupt 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT1</name>
                     <description>External Interrupt 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT2</name>
                     <description>External Interrupt 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT3</name>
                     <description>External Interrupt 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT4</name>
                     <description>External Interrupt 4 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT5</name>
                     <description>External Interrupt 5 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT6</name>
                     <description>External Interrupt 6 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT7</name>
                     <description>External Interrupt 7 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x10</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT1</name>
                     <description>External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT2</name>
                     <description>External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT3</name>
                     <description>External Interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT4</name>
                     <description>External Interrupt 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT5</name>
                     <description>External Interrupt 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT6</name>
                     <description>External Interrupt 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTINT7</name>
                     <description>External Interrupt 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAKEUP</name>
               <description>Wake-Up Enable</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>WAKEUPEN0</name>
                     <description>External Interrupt 0 Wake-up Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN1</name>
                     <description>External Interrupt 1 Wake-up Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN2</name>
                     <description>External Interrupt 2 Wake-up Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN3</name>
                     <description>External Interrupt 3 Wake-up Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN4</name>
                     <description>External Interrupt 4 Wake-up Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN5</name>
                     <description>External Interrupt 5 Wake-up Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN6</name>
                     <description>External Interrupt 6 Wake-up Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUPEN7</name>
                     <description>External Interrupt 7 Wake-up Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
