atsamd-rs/atsamd/svd/ATSAMD11C14A.svd
            <register>
               <name>DFLLCTRL</name>
               <description>DFLL48M Control</description>
               <addressOffset>0x24</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DFLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Operating Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STABLE</name>
                     <description>Stable DFLL Frequency</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LLAW</name>
                     <description>Lose Lock After Wake</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBCRM</name>
                     <description>USB Clock Recovery Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCDIS</name>
                     <description>Chill Cycle Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QLDIS</name>
                     <description>Quick Lock Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BPLCKC</name>
                     <description>Bypass Coarse Lock</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAITLOCK</name>
                     <description>Wait Lock</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLVAL</name>
               <description>DFLL48M Value</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>FINE</name>
                     <description>Fine Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>COARSE</name>
                     <description>Coarse Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Multiplication Ratio Difference</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLMUL</name>
               <description>DFLL48M Multiplier</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>MUL</name>
                     <description>DFLL Multiply Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FSTEP</name>
                     <description>Fine Maximum Step</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSTEP</name>
                     <description>Coarse Maximum Step</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLSYNC</name>
               <description>DFLL48M Synchronization</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>READREQ</name>
                     <description>Read Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BOD33</name>
               <description>3.3V Brown-Out Detector (BOD33) Control</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Hysteresis</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACTION</name>
                     <description>BOD33 Action</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACTIONSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>The BOD33 generates a reset</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERRUPT</name>
                           <description>The BOD33 generates an interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Operation Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN</name>
                     <description>Clock Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PSEL</name>
                     <description>Prescaler Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PSELSelect</name>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide clock by 2</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide clock by 4</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide clock by 8</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide clock by 16</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide clock by 32</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide clock by 64</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide clock by 128</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Divide clock by 256</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV512</name>
                           <description>Divide clock by 512</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV1K</name>
                           <description>Divide clock by 1024</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2K</name>
                           <description>Divide clock by 2048</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4K</name>
                           <description>Divide clock by 4096</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8K</name>
                           <description>Divide clock by 8192</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16K</name>
                           <description>Divide clock by 16384</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32K</name>
                           <description>Divide clock by 32768</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64K</name>
                           <description>Divide clock by 65536</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL</name>
                     <description>BOD33 Threshold Level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREF</name>
               <description>Voltage References System (VREF) Control</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>TSEN</name>
                     <description>Temperature Sensor Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BGOUTEN</name>
                     <description>Bandgap Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALIB</name>
                     <description>Bandgap Voltage Generator Calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLA</name>
               <description>DPLL Control A</description>
               <addressOffset>0x44</addressOffset>
               <size>8</size>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DPLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Clock Activation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLRATIO</name>
               <description>DPLL Ratio Control</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>LDR</name>
                     <description>Loop Divider Ratio</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>LDRFRAC</name>
                     <description>Loop Divider Ratio Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLCTRLB</name>
               <description>DPLL Control B</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>FILTER</name>
                     <description>Proportional Integral Filter Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FILTERSelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>Default filter mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LBFILT</name>
                           <description>Low bandwidth filter</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HBFILT</name>
                           <description>High bandwidth filter</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HDFILT</name>
                           <description>High damping filter</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPEN</name>
                     <description>Low-Power Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF</name>
                     <description>Wake Up Fast</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCLK</name>
                     <description>Reference Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>REFCLKSelect</name>
                        <enumeratedValue>
                           <name>REF0</name>
                           <description>CLK_DPLL_REF0 clock reference</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REF1</name>
                           <description>CLK_DPLL_REF1 clock reference</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>GCLK_DPLL clock reference</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LTIME</name>
                     <description>Lock Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LTIMESelect</name>
                        <enumeratedValue>
                           <name>DEFAULT</name>
                           <description>No time-out</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MS</name>
                           <description>Time-out if no lock within 8 ms</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9MS</name>
                           <description>Time-out if no lock within 9 ms</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10MS</name>
                           <description>Time-out if no lock within 10 ms</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11MS</name>
                           <description>Time-out if no lock within 11 ms</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LBYPASS</name>
                     <description>Lock Bypass</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLLSTATUS</name>
               <description>DPLL Status</description>
               <addressOffset>0x50</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>DPLL Lock Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKRDY</name>
                     <description>Output Clock Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>DPLL Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Divider Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
