atsamd-rs/atsamd/svd/ATSAMD11C14A.svd
                  <register>
                     <name>EPINTENCLR</name>
                     <description>DEVICE_ENDPOINT End Point Interrupt Clear Flag</description>
                     <addressOffset>0x8</addressOffset>
                     <size>8</size>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Disable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Disable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL0</name>
                           <description>Error Flow 0 Interrupt Disable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL1</name>
                           <description>Error Flow 1 Interrupt Disable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>RXSTP</name>
                           <description>Received Setup Interrupt Disable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL0</name>
                           <description>Stall 0 In/Out Interrupt Disable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL1</name>
                           <description>Stall 1 In/Out Interrupt Disable</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPINTENSET</name>
                     <description>DEVICE_ENDPOINT End Point Interrupt Set Flag</description>
                     <addressOffset>0x9</addressOffset>
                     <size>8</size>
                     <modifiedWriteValues>oneToSet</modifiedWriteValues>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Enable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Enable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL0</name>
                           <description>Error Flow 0 Interrupt Enable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL1</name>
                           <description>Error Flow 1 Interrupt Enable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>RXSTP</name>
                           <description>Received Setup Interrupt Enable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL0</name>
                           <description>Stall 0 In/out Interrupt enable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL1</name>
                           <description>Stall 1 In/out Interrupt enable</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
               </cluster>
            </cluster>
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <version>U22032.0.0</version>
         <description>Watchdog Timer</description>
         <baseAddress>0x40001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x9</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WDT</name>
            <description>Watchdog Timer</description>
            <value>2</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WEN</name>
                     <description>Watchdog Timer Window Mode Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALWAYSON</name>
                     <description>Always-On</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG</name>
               <description>Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0xBB</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>Time-Out Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PERSelect</name>
                        <enumeratedValue>
                           <name>PER_8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PER_512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1K</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2K</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4K</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8K</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16K</name>
                           <description>16384 clock cycles</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WINDOW</name>
                     <description>Window Mode Time-Out Period</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WINDOWSelect</name>
                        <enumeratedValue>
                           <name>WINDOW_8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WINDOW_512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1K</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2K</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4K</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8K</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16K</name>
                           <description>16384 clock cycles</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EWCTRL</name>
               <description>Early Warning Interrupt Control</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x0B</resetValue>
               <fields>
                  <field>
                     <name>EWOFFSET</name>
                     <description>Early Warning Interrupt Time Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EWOFFSETSelect</name>
                        <enumeratedValue>
                           <name>EWOFFSET_8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EWOFFSET_512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1K</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2K</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4K</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8K</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16K</name>
                           <description>16384 clock cycles</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SYNCBUSY</name>
                     <description>Synchronization Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLEAR</name>
               <description>Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CLEAR</name>
                     <description>Watchdog Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLEARSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Clear Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
